--░██████╗████████╗██████╗░███████╗███████╗░█████╗░  ███████╗██╗██╗░░░██╗███████╗███╗░░░███╗
--██╔════╝╚══██╔══╝██╔══██╗██╔════╝██╔════╝██╔══██╗  ██╔════╝██║██║░░░██║██╔════╝████╗░████║
--╚█████╗░░░░██║░░░██████╔╝█████╗░░█████╗░░███████║  █████╗░░██║╚██╗░██╔╝█████╗░░██╔████╔██║
--░╚═══██╗░░░██║░░░██╔══██╗██╔══╝░░██╔══╝░░██╔══██║  ██╔══╝░░██║░╚████╔╝░██╔══╝░░██║╚██╔╝██║
--██████╔╝░░░██║░░░██║░░██║███████╗██║░░░░░██║░░██║  ██║░░░░░██║░░╚██╔╝░░███████╗██║░╚═╝░██║
--╚═════╝░░░░╚═╝░░░╚═╝░░╚═╝╚══════╝╚═╝░░░░░╚═╝░░╚═╝  ╚═╝░░░░░╚═╝░░░╚═╝░░░╚══════╝╚═╝░░░░░╚═╝
-- CREATED BY ziemson#7028 for d𝖎𝖘𝖈𝖔𝖗𝖉.𝖌𝖌/𝖘𝖙𝖗𝖊𝖋𝖆𝖋𝖎𝖛𝖊𝖒

--d𝖎𝖘𝖈𝖔𝖗𝖉.𝖌𝖌/𝖘𝖙𝖗𝖊𝖋𝖆𝖋𝖎𝖛𝖊𝖒-- --d𝖎𝖘𝖈𝖔𝖗𝖉.𝖌𝖌/𝖘𝖙𝖗𝖊𝖋𝖆𝖋𝖎𝖛𝖊𝖒-- --d𝖎𝖘𝖈𝖔𝖗𝖉.𝖌𝖌/𝖘𝖙𝖗𝖊𝖋𝖆𝖋𝖎𝖛𝖊𝖒--
Locales['polskagurom'] = {
  ['nacisnijabyprzejac'] = 'Naciśnij ~INPUT_CONTEXT~ aby ~o~przejąć~s~ strefe na ~b~%s~s~',
  ['przejmowankotajmer'] = 'Przejmowanie strefy: ~r~%s~s~ sekund do końca',
  ['przejetastrefaczas'] = 'Ta strefa została nie dawno przejęta. Proszę poczekać ~y~%s~s~ sekund przed kolejnym napadem',
  ['przejeciejuzwystartowane'] = '~r~Przejmowanie strefy w ~b~%s~s~',
  ['przejeciestrefito'] = 'Rozpoczałęś przejmowanie strefy ~y~%s~s~',
  ['infoostarcie'] = 'Inne organizacje zostały poinformowane o przejęciu',
  ['wykonanieprzejecia'] = '~r~Przejęcie strefy udane!~s~, ~o~Zdobyłeś~s~ ~g~$%s~s~',
  ['wykonanieprzejeciawlubna'] = '~r~Przejęcie strefy udane na ~y~%s~s~',
  ['przejeciestop'] = 'Przejęcie strefy zostało anulowane',
  ['przejeciestopwlubna'] = '~r~Przejęcie strefy na ~b~%s~s~ zostało anulowany!',
  ['brakludziworg'] = 'Jest za mało ~b~%s członków organizacji~s~ na rejonie aby przejąć strefe',
  ['przejeciewtoku'] = '~r~Przejęcie strefy już trwa',
  ['wyjmijbrondebilu'] = 'Musisz wyjąć broń aby przejąć strefe'
}
--d𝖎𝖘𝖈𝖔𝖗𝖉.𝖌𝖌/𝖘𝖙𝖗𝖊𝖋𝖆𝖋𝖎𝖛𝖊𝖒-- --d𝖎𝖘𝖈𝖔𝖗𝖉.𝖌𝖌/𝖘𝖙𝖗𝖊𝖋𝖆𝖋𝖎𝖛𝖊𝖒-- --d𝖎𝖘𝖈𝖔𝖗𝖉.𝖌𝖌/𝖘𝖙𝖗𝖊𝖋𝖆𝖋𝖎𝖛𝖊𝖒--

--░██████╗████████╗██████╗░███████╗███████╗░█████╗░  ███████╗██╗██╗░░░██╗███████╗███╗░░░███╗
--██╔════╝╚══██╔══╝██╔══██╗██╔════╝██╔════╝██╔══██╗  ██╔════╝██║██║░░░██║██╔════╝████╗░████║
--╚█████╗░░░░██║░░░██████╔╝█████╗░░█████╗░░███████║  █████╗░░██║╚██╗░██╔╝█████╗░░██╔████╔██║
--░╚═══██╗░░░██║░░░██╔══██╗██╔══╝░░██╔══╝░░██╔══██║  ██╔══╝░░██║░╚████╔╝░██╔══╝░░██║╚██╔╝██║
--██████╔╝░░░██║░░░██║░░██║███████╗██║░░░░░██║░░██║  ██║░░░░░██║░░╚██╔╝░░███████╗██║░╚═╝░██║
--╚═════╝░░░░╚═╝░░░╚═╝░░╚═╝╚══════╝╚═╝░░░░░╚═╝░░╚═╝  ╚═╝░░░░░╚═╝░░░╚═╝░░░╚══════╝╚═╝░░░░░╚═╝
-- CREATED BY ziemson#7028 for d𝖎𝖘𝖈𝖔𝖗𝖉.𝖌𝖌/𝖘𝖙𝖗𝖊𝖋𝖆𝖋𝖎𝖛𝖊𝖒